# Coding Exercises

## Full Data Workflow A-Z: Merging, Joining, Concatenating

### Exercise 12: Merging, joining, aligning and concatenating Data

--------------------------------------------------------------------------------------------------------------

### Concatenating DataFrames vertically

__Import__ the cars dataset (with cars from usa and europe) from the csv-file __cars_clean.csv__. <br>
Also __import__ the csv-file __cars_jap.csv__ (with cars from japan) and __concatenate__ both DataFrames __vertically__! <br>
__Save__ the __concatenated DataFrame__ in the variable __cars_all__! <br>
Finally, __sort__ cars_all by the model_year from __low to high__!

In [1]:
import pandas as pd

In [3]:
cars_data = pd.read_csv('cars_clean.csv')

In [6]:
cars_data.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [4]:
cars_jp = pd.read_csv('cars_jap.csv')

In [7]:
cars_jp.head()

    mpg  cyl   disp    hp  weight   acc  year                   name
0  24.0    4  113.0  95.0    2372  15.0    70  toyota corona mark ii
1  27.0    4   97.0  88.0    2130  14.5    70           datsun pl510
2  27.0    4   97.0  88.0    2130  14.5    71           datsun pl510
3  25.0    4  113.0  95.0    2228  14.0    71          toyota corona
4  31.0    4   71.0  65.0    1773  19.0    71    toyota corolla 1200

In [11]:
pd.concat([cars_data, cars_jp], axis=0)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,cyl,disp,hp,acc,year
0,18.0,8.0,307.0,130.0,3504,12.0,70.0,usa,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8.0,350.0,165.0,3693,11.5,70.0,usa,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8.0,318.0,150.0,3436,11.0,70.0,usa,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8.0,304.0,150.0,3433,12.0,70.0,usa,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8.0,302.0,140.0,3449,10.5,70.0,usa,ford torino,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
74,34.0,NaN,NaN,NaN,2245,NaN,NaN,NaN,toyota corolla,4.0,108.0,70.0,16.9,82.0
75,38.0,NaN,NaN,NaN,1965,NaN,NaN,NaN,honda civic,4.0,91.0,67.0,15.0,82.0
76,32.0,NaN,NaN,NaN,1965,NaN,NaN,NaN,honda civic (auto),4.0,91.0,67.0,15.7,82.0
77,38.0,NaN,NaN,NaN,1995,NaN,NaN,NaN,datsun 310 gx,4.0,91.0,67.0,16.2,82.0
78,32.0,NaN,NaN,NaN,2665,NaN,NaN,NaN,toyota celica gt,4.0,144.0,96.0,13.9,82.0

In [12]:
cars_all = pd.concat([cars_data, cars_jp], axis=0)

In [14]:
cars_all.shape

(392, 14)

In [22]:
cars_all.sort_values(by='model_year', ascending=True)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,cyl,disp,hp,acc,year
0,18.0,8.0,307.0,130.0,3504,12.0,70.0,usa,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
26,9.0,8.0,304.0,193.0,4732,18.5,70.0,usa,ih 1200d,NaN,NaN,NaN,NaN,NaN
25,11.0,8.0,318.0,210.0,4382,13.5,70.0,usa,dodge d200,NaN,NaN,NaN,NaN,NaN
24,10.0,8.0,307.0,200.0,4376,15.0,70.0,usa,chevrolet c20,NaN,NaN,NaN,NaN,NaN
23,10.0,8.0,360.0,215.0,4615,14.0,70.0,usa,ford f250,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
74,34.0,NaN,NaN,NaN,2245,NaN,NaN,NaN,toyota corolla,4.0,108.0,70.0,16.9,82.0
75,38.0,NaN,NaN,NaN,1965,NaN,NaN,NaN,honda civic,4.0,91.0,67.0,15.0,82.0
76,32.0,NaN,NaN,NaN,1965,NaN,NaN,NaN,honda civic (auto),4.0,91.0,67.0,15.7,82.0
77,38.0,NaN,NaN,NaN,1995,NaN,NaN,NaN,datsun 310 gx,4.0,91.0,67.0,16.2,82.0
78,32.0,NaN,NaN,NaN,2665,NaN,NaN,NaN,toyota celica gt,4.0,144.0,96.0,13.9,82.0

In [20]:
cars_all["model_year"]

0     70.0
1     70.0
2     70.0
3     70.0
4     70.0
      ...
74     NaN
75     NaN
76     NaN
77     NaN
78     NaN
Name: model_year, Length: 392, dtype: float64

### need to align before concat

In [48]:
cars_jp.insert(7, "origin", "japan")
# insert(loc, column, value, allow_duplicates = False)

In [49]:
cars_jp.columns = cars_data.columns
#overwriting the columns

In [50]:
cars_jp.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,24.0,4,113.0,95.0,2372,15.0,70,japan,toyota corona mark ii
1,27.0,4,97.0,88.0,2130,14.5,70,japan,datsun pl510
2,27.0,4,97.0,88.0,2130,14.5,71,japan,datsun pl510
3,25.0,4,113.0,95.0,2228,14.0,71,japan,toyota corona
4,31.0,4,71.0,65.0,1773,19.0,71,japan,toyota corolla 1200

In [51]:
cars_all2 = pd.concat([cars_data, cars_jp], ignore_index=True)

In [54]:
cars_all2.head()
cars_all2.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
387,34.0,4,108.0,70.0,2245,16.9,82,japan,toyota corolla
388,38.0,4,91.0,67.0,1965,15.0,82,japan,honda civic
389,32.0,4,91.0,67.0,1965,15.7,82,japan,honda civic (auto)
390,38.0,4,91.0,67.0,1995,16.2,82,japan,datsun 310 gx
391,32.0,4,144.0,96.0,2665,13.9,82,japan,toyota celica gt

In [55]:
cars_all2 = cars_all2.sort_values("model_year").reset_index(drop=True)

In [57]:
cars_all2.head()
cars_all2.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
387,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
388,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
389,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
390,38.0,4,91.0,67.0,1995,16.2,82,japan,datsun 310 gx
391,32.0,4,144.0,96.0,2665,13.9,82,japan,toyota celica gt

In [58]:
cars_all2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 392 entries, 0 to 391
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    int64
 5   acceleration  392 non-null    float64
 6   model_year    392 non-null    int64
 7   origin        392 non-null    object
 8   name          392 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 27.7+ KB

### Left Join

__Import__ the csv-files __summer.csv__ (as summer) and __dictionary.csv__ (as dic) which contains the __full country name__ for the olympic country codes as well as __population__ and __gdp__ statistics for some countries.<br>

__"Copy and paste"__ the __full country name__, __population__ and __gdp__ from the dic DataFrame __into the summer DataFrame__ with a __Left Join__!<br>
__Save__ the new merged DataFrame in the variable __summer_new__!<br>

__Inspect__ summer_new and determine the __olympic country codes__ for which the dic DataFrame does __not provide__ any information!

In [23]:
summer = pd.read_csv('summer.csv')
dic = pd.read_csv('dictionary.csv')

In [24]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [25]:
dic.head()

           Country Code  Population  GDP per Capita
0      Afghanistan  AFG  32526562.0      594.323081
1          Albania  ALB   2889167.0     3945.217582
2          Algeria  ALG  39666519.0     4206.031232
3  American Samoa*  ASA     55538.0             NaN
4          Andorra  AND     70473.0             NaN

In [43]:
pd.merge(summer, dic, how='left')

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal,Code,Population,GDP per Capita
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,NaN,NaN,NaN
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,NaN,NaN,NaN
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,NaN,NaN,NaN
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,NaN,NaN,NaN
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze,NaN,NaN,NaN
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold,NaN,NaN,NaN
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver,NaN,NaN,NaN
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze,NaN,NaN,NaN
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze,NaN,NaN,NaN

In [44]:
pd.merge(summer, dic, how='left', left_on="Country", right_on='Code')

,Year,City,Sport,Discipline,Athlete,Country_x,Gender,Event,Medal,Country_y,Code,Population,GDP per Capita
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Hungary,HUN,9844686.0,12363.543460
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Austria,AUT,8611088.0,43774.985174
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Greece,GRE,10823732.0,18002.230578
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,Greece,GRE,10823732.0,18002.230578
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,Greece,GRE,10823732.0,18002.230578
...,...,...,...,...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze,Poland,POL,37999494.0,12554.547554
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold,Iran,IRI,79109272.0,NaN
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver,Russia,RUS,144096812.0,9092.580536
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze,Armenia,ARM,3017712.0,3489.127690
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze,Sweden,SWE,9798871.0,50579.673649

In [45]:
summer_new = pd.merge(summer, dic, how='left', left_on="Country", right_on='Code')

In [46]:
summer_new.head()

,Year,City,Sport,Discipline,Athlete,Country_x,Gender,Event,Medal,Country_y,Code,Population,GDP per Capita
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Hungary,HUN,9844686.0,12363.543460
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Austria,AUT,8611088.0,43774.985174
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Greece,GRE,10823732.0,18002.230578
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,Greece,GRE,10823732.0,18002.230578
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,Greece,GRE,10823732.0,18002.230578

### Arithmetic operations between DataFrames / Alignment

__Import__ the csv-files __ath_2008.csv__ and __ath_2012.csv__ with all medals winners in the Sport __Athletics__ in the Editions __2008__ and __2012__.

In [59]:
ath_08 = pd.read_csv('ath_2008.csv')
ath_12 = pd.read_csv('ath_2012.csv')

In [64]:
import numpy as np

In [60]:
ath_08.head()

              Athlete  Gold  Silver  Bronze
0    ABAKUMOVA, Maria     0       1       0
1  ABEYLEGESSE, Elvan     0       2       0
2  ALEKNA, Virgilijus     0       0       1
3      ALEXEEV, Denis     0       0       1
4     ANTONOVA, Olena     0       0       1

In [61]:
ath_12.head()

              Athlete  Gold  Silver  Bronze
0      ADAMS, Valerie     1       0       0
1  ALLEYNE-FORTE, Ade     0       0       1
2         AMOS, Nijel     0       1       0
3    ANTYUKH, Natalya     1       1       0
4       ASSEFA, Sofia     0       1       0

In [62]:
ath_08.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Athlete  159 non-null    object
 1   Gold     159 non-null    int64
 2   Silver   159 non-null    int64
 3   Bronze   159 non-null    int64
dtypes: int64(3), object(1)
memory usage: 5.1+ KB

In [63]:
ath_12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 171 entries, 0 to 170
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Athlete  171 non-null    object
 1   Gold     171 non-null    int64
 2   Silver   171 non-null    int64
 3   Bronze   171 non-null    int64
dtypes: int64(3), object(1)
memory usage: 5.5+ KB

In [69]:
pd.merge(ath_08, ath_12, how="left", left_on="Athlete", right_on="Gold")
#can't be done because of invalid key types

ValueError: You are trying to merge on object and int64 columns. If you wish to proceed you should use pd.concat

In [70]:
ath_08.set_index("Athlete", inplace=True)
ath_12.set_index("Athlete", inplace=True)

For __all Athletes__ in the two DataFrames, __aggregate/add__ the total number of __Gold__, __Silver__ and __Bronze__ Medals over both editions! __Save__ the aggregated DataFrame in the variable __add__. (Hint: add should contain an index with the Athlete names and three columns, Gold, Silver, Bronze)

__Sort__ add by Gold, Silver, Bronze from __high to low__! Change datatype to __integer__, if necessary! The first Athlete in your DataFrame should be ... no surprise ... Usain Bolt with 6 Gold and 0 Silver and Bronze Medals.

-------------------------------------